tylertms/dspic33e-sim/tests/device/dspic33ep_mu/memory/dma_test.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device/dspic33ep_mu/device.h"
#include "dspic33.h"
#include "test.h"

enum {
    DMA_FORCE = 0x8000u,
    DMA_TEST_READ_PAD = 0x0290u,
    DMA_TEST_WRITE_PAD = 0x0298u,
    DMA_TEST_ALT_WRITE_PAD = 0x0904u,
    DMA_TEST_BIDIRECTIONAL_PAD = 0x0608u,
    OPCODE_MOV_W1_POST_INCREMENT_W2 = 0x780131u
};

static const uint16_t readable_pads[] = {0x0144u, 0x014cu, 0x0154u, 0x015cu, 0x0226u, 0x0236u,
                                         0x0248u, 0x0256u, 0x0268u, 0x0290u, 0x02a8u, 0x02b6u,
                                         0x02c8u, 0x0300u, 0x0340u, 0x0440u, 0x0540u, 0x0608u};

static const uint16_t writable_pads[] = {
    0x0224u, 0x0234u, 0x0248u, 0x0254u, 0x0268u, 0x0298u, 0x02a8u, 0x02b4u, 0x02c8u, 0x0442u,
    0x0542u, 0x0608u, 0x0904u, 0x0906u, 0x090eu, 0x0910u, 0x0918u, 0x091au, 0x0922u, 0x0924u};

static const uint8_t dma_irqs[DSPIC33_DMA_COUNT] = {4u,   14u,  24u,  36u,  46u,  61u,  68u, 69u,
                                                    118u, 119u, 120u, 121u, 130u, 131u, 132u};

static uint16_t channel_base(uint8_t channel) { return (uint16_t)(0x0b00u + channel * 0x10u); }

void dspic33_dma_test_boundary_cases(TestState* state, Dspic33* cpu);
void dspic33_device_internal_run_dma(Dspic33* cpu, uint16_t source, uint32_t event_value);

static uint16_t stored_word(const Dspic33* cpu, uint16_t address) {
    return (uint16_t)(cpu->data[address] | ((uint16_t)cpu->data[address + 1u] << 8u));
}

static void store_peripheral_word(Dspic33* cpu, uint16_t value) {
    cpu->data[DMA_TEST_READ_PAD] = (uint8_t)value;
    cpu->data[DMA_TEST_READ_PAD + 1u] = (uint8_t)(value >> 8u);
}

static bool interrupt_flag(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = dma_irqs[channel];
    return (dspic33_read_word(cpu, (uint16_t)(0x0800u + (irq / 16u) * 2u)) &
            (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = dma_irqs[channel];
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    uint16_t mask = (uint16_t)(1u << (irq % 16u));
    dspic33_write_word(cpu, address, (uint16_t)(dspic33_read_word(cpu, address) & ~mask));
}

static void configure_channel(Dspic33* cpu, uint8_t channel, uint16_t control, uint8_t request,
                              uint32_t start_a, uint32_t start_b, uint16_t pad, uint16_t count) {
    uint16_t base = channel_base(channel);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)start_a);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(start_a >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)start_b);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0au), (uint16_t)(start_b >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), count);
    dspic33_write_word(cpu, base, (uint16_t)(control | 0x8000u));
}

static bool request(Dspic33* cpu, uint8_t source, uint16_t indirect) {
    return dspic33_dma_request(cpu, source, indirect, 0u) && dspic33_device_advance(cpu, 1u);
}

static void expect_dma_address(TestState* state, Dspic33* cpu, uint16_t control,
                               uint32_t address, bool valid, const char* execution,
                               const char* result) {
    dspic33_reset(cpu, 0u);
    cpu->data[address] = 0xa5u;
    if (address + 1u < DSPIC33_DATA_SIZE) {
        cpu->data[address + 1u] = 0x5au;
    }
    dspic33_write_word(cpu, DMA_TEST_WRITE_PAD, 0xffffu);
    configure_channel(cpu, 0u, control, 0xe0u, address, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0xe0u, 0u), execution);
    expect(state,
           valid ? stored_word(cpu, DMA_TEST_WRITE_PAD) ==
                       ((control & 0x4000u) != 0u ? 0xffa5u : 0x5aa5u)
                 : stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xffffu && cpu->last_trap == 6u &&
                       (dspic33_read_word(cpu, 0x08c4u) & 0x0020u) != 0u,
           result);
}

static void device_memory_address_cases(TestState* state) {
    for (Dspic33epMuDevice device = DSPIC33EP_MU_DEVICE_256MU806;
         device < DSPIC33EP_MU_DEVICE_COUNT; device++) {
        Dspic33* cpu = dspic33_create_for_device(device);
        expect(state, cpu != NULL, "create profile DMA processor");
        if (cpu == NULL) {
            continue;
        }
        const uint32_t data_limit = dspic33_device_profile(cpu)->data_limit;
        expect_dma_address(state, cpu, 0x6001u, 0x0fffu, false,
                           "request DMA below SRAM", "DMA below SRAM traps");
        expect_dma_address(state, cpu, 0x6001u, 0x1000u, true,
                           "request DMA at SRAM start", "DMA accepts SRAM start");
        expect_dma_address(state, cpu, 0x6001u, data_limit - 1u, true,
                           "request DMA byte at SRAM end", "DMA accepts final SRAM byte");
        expect_dma_address(state, cpu, 0x6001u, data_limit, false,
                           "request DMA byte beyond SRAM", "DMA byte beyond SRAM traps");
        expect_dma_address(state, cpu, 0x2001u, data_limit - 2u, true,
                           "request DMA word at SRAM end", "DMA accepts final SRAM word");
        expect_dma_address(state, cpu, 0x2001u, data_limit, false,
                           "request DMA word beyond SRAM", "DMA word beyond SRAM traps");
        expect_dma_address(state, cpu, 0x2001u, 0x1001u, false,
                           "request unaligned DMA word", "unaligned DMA word traps");
        dspic33_destroy(cpu);
    }
}

static void device_dual_port_ram_cases(TestState* state) {
    for (Dspic33epMuDevice device = DSPIC33EP_MU_DEVICE_256MU806;
         device < DSPIC33EP_MU_DEVICE_COUNT; device++) {
        Dspic33* cpu = dspic33_create_for_device(device);
        expect(state, cpu != NULL, "create profile DMA arbitration processor");
        if (cpu == NULL) {
            continue;
        }
        const uint16_t dma_ram_base = dspic33_device_profile(cpu)->dma_ram_base;
        dspic33_write_word(cpu, dma_ram_base, 0x5aa5u);
        configure_channel(cpu, 0u, 0x2001u, 0xe1u, dma_ram_base, 0u, DMA_TEST_WRITE_PAD, 0u);
        cpu->io.cpu_bus_cycle = cpu->cycles;
        cpu->io.dma_peripheral_pending = 1u;
        dspic33_device_internal_run_dma(cpu, 0u,
                                        (uint32_t)cpu->io.dma_generation[0] << 17u);
        expect(state,
               stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x5aa5u &&
                   (cpu->io.dma_arbiter_waiting & 1u) == 0u && cpu->io.dma_active == 1u,
               "profile DMA RAM bypasses CPU bus arbitration");
        dspic33_destroy(cpu);
    }
}

