tylertms/dspic33e-sim/tests/device/dspic33ep_mu/memory/dma_test.c
static bool pad_in_set(uint16_t pad, const uint16_t* pads, size_t count) {
    size_t index;
    for (index = 0u; index < count; index++) {
        if (pad == pads[index]) {
            return true;
        }
    }
    return false;
}

static void pad_membership_cases(TestState* state) {
    static const uint16_t firmware_read_pads[] = {0x0236u, 0x0248u, 0x0256u, 0x0300u, 0x0608u};
    static const uint16_t firmware_write_pads[] = {0x0234u, 0x0248u, 0x0254u, 0x0608u};
    uint32_t address;
    uint32_t readable = 0u;
    uint32_t writable = 0u;
    uint32_t either = 0u;
    bool exact = true;
    size_t index;
    for (address = 0u; address <= UINT16_MAX; address++) {
        bool expected_read = pad_in_set((uint16_t)address, readable_pads,
                                        sizeof(readable_pads) / sizeof(readable_pads[0]));
        bool expected_write = pad_in_set((uint16_t)address, writable_pads,
                                         sizeof(writable_pads) / sizeof(writable_pads[0]));
        bool actual_read = dspic33_device_dma_pad_valid((uint16_t)address, false);
        bool actual_write = dspic33_device_dma_pad_valid((uint16_t)address, true);
        exact = exact && actual_read == expected_read && actual_write == expected_write;
        readable += actual_read;
        writable += actual_write;
        either += actual_read || actual_write;
    }
    expect(state, exact && readable == 18u && writable == 20u && either == 33u,
           "DMA PAD direction allowlists are exhaustive");
    exact = true;
    for (index = 0u; index < sizeof(firmware_read_pads) / sizeof(firmware_read_pads[0]); index++) {
        exact = exact && dspic33_device_dma_pad_valid(firmware_read_pads[index], false);
    }
    for (index = 0u; index < sizeof(firmware_write_pads) / sizeof(firmware_write_pads[0]);
         index++) {
        exact = exact && dspic33_device_dma_pad_valid(firmware_write_pads[index], true);
    }
    expect(state, exact, "firmware DMA PAD routes remain supported");
}

static void register_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    dspic33_reset(cpu, 0u);
    for (channel = 0u; channel < DSPIC33_DMA_COUNT; channel++) {
        uint16_t base = channel_base(channel);
        expect(state, dspic33_read_word(cpu, base) == 0u, "DMAxCON reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0u, "DMAxREQ reset");
        dspic33_write_word(cpu, base, 0x7fffu);
        expect(state, dspic33_read_word(cpu, base) == 0x7833u, "DMAxCON mask");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x7fffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0x00ffu, "DMAxREQ mask");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0xffffu);
        dspic33_write_word(cpu, (uint16_t)(base + 0x0au), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x00ffu, "DMAxSTAH mask");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) == 0x00ffu, "DMAxSTBH mask");
        dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) == 0x3fffu, "DMAxCNT mask");
    }
    dspic33_write_word(cpu, 0x0bf0u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf2u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf4u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf6u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf8u, 0xffffu);
    dspic33_write_word(cpu, 0x0bfau, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x0bf0u) == 0u, "DMAPWC read only");
    expect(state, dspic33_read_word(cpu, 0x0bf2u) == 0u, "DMARQC read only");
    expect(state, dspic33_read_word(cpu, 0x0bf4u) == 0u, "DMAPPS read only");
    expect(state, dspic33_read_word(cpu, 0x0bf6u) == 0x000fu, "DMALCA reset and read only");
    expect(state, dspic33_read_word(cpu, 0x0bf8u) == 0u, "DSADRL read only");
    expect(state, dspic33_read_word(cpu, 0x0bfau) == 0u, "DSADRH read only");
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_DMA, DSPIC33_DMA_COUNT * 2u, 0u, 0u) &&
               dspic33_device_advance(cpu, 0u) && cpu->io.dma_active == 0u,
           "invalid DMA event source ignored");
}

static void direction_and_width_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x5aa5u);
    configure_channel(cpu, 0u, 0x2001u, 0x44u, 0x2000u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x44u, 0u), "word RAM request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x5aa5u, "word RAM to peripheral");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u, "word one-shot disables");
    expect(state, interrupt_flag(cpu, 0u), "word full interrupt");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0xa55au);
    dspic33_write_word(cpu, DMA_TEST_WRITE_PAD, 0x7e00u);
    configure_channel(cpu, 0u, 0x6001u, 0x45u, 0x2000u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x45u, 0u), "byte RAM request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x7e5au, "byte RAM to peripheral");

    dspic33_reset(cpu, 0u);
    store_peripheral_word(cpu, 0x369cu);
    configure_channel(cpu, 0u, 0x0001u, 0x46u, 0x2000u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, request(cpu, 0x46u, 0u), "word peripheral request");
    expect(state, dspic33_read_word(cpu, 0x2000u) == 0x369cu, "word peripheral to RAM");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0xcc00u);
    store_peripheral_word(cpu, 0x12abu);
    configure_channel(cpu, 0u, 0x4001u, 0x47u, 0x2000u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, request(cpu, 0x47u, 0u), "byte peripheral request");
    expect(state, dspic33_read_word(cpu, 0x2000u) == 0xccabu, "byte peripheral to RAM");
}

static void invalid_write_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x5aa5u);
    configure_channel(cpu, 0u, 0x2001u, 0x48u, 0x2000u, 0u, 0x0e32u, 0u);
    expect(state, request(cpu, 0x48u, 0u), "invalid word PAD request");
    expect(state,
           dspic33_read_word(cpu, 0x0e34u) == 0u && interrupt_flag(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u,
           "invalid word PAD invokes no handler and completes");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x00a5u);
    configure_channel(cpu, 0u, 0x6001u, 0x49u, 0x2000u, 0u, 0x0e32u, 0u);
    expect(state, request(cpu, 0x49u, 0u), "invalid low-byte PAD request");
    expect(state, dspic33_read_word(cpu, 0x0e34u) == 0u, "invalid low-byte PAD invokes no handler");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x003cu);
    configure_channel(cpu, 0u, 0x6001u, 0x4au, 0x2000u, 0u, 0x0e33u, 0u);
    expect(state, request(cpu, 0x4au, 0u), "invalid high-byte PAD request");
    expect(state, dspic33_read_word(cpu, 0x0e34u) == 0u,
           "invalid high-byte PAD invokes no handler");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x5aa5u);
    configure_channel(cpu, 0u, 0x2001u, 0x4bu, 0x2000u, 0u, 0x0e32u, 0u);
    expect(state, dspic33_dma_request(cpu, 0x4bu, 0u, 1u),
           "queue invalid PAD with concurrent CPU write");
    dspic33_write_word(cpu, 0x0e32u, 0x7777u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_read_word(cpu, 0x0e34u) == 0x7777u &&
               dspic33_read_word(cpu, 0x0bf0u) == 0u && cpu->trap_count == 0u,
           "invalid write PAD cannot raise a peripheral collision");
}

static void addressing_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0000u, 0x50u, 0x2200u, 0u, DMA_TEST_READ_PAD, 2u);
    store_peripheral_word(cpu, 0x1111u);
    expect(state, request(cpu, 0x50u, 0u), "post-increment first request");
    expect(state, dspic33_read_word(cpu, 0x0b04u) == 0x2200u,
           "post-increment preserves start register");
    store_peripheral_word(cpu, 0x2222u);
    expect(state, request(cpu, 0x50u, 0u), "post-increment second request");
    expect(state, dspic33_read_word(cpu, 0x0b04u) == 0x2200u,
           "post-increment keeps start register stable");
    store_peripheral_word(cpu, 0x3333u);
    expect(state, request(cpu, 0x50u, 0u), "post-increment third request");
    expect(state,
           dspic33_read_word(cpu, 0x2200u) == 0x1111u &&
               dspic33_read_word(cpu, 0x2202u) == 0x2222u &&
               dspic33_read_word(cpu, 0x2204u) == 0x3333u,
           "post-increment addresses");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0000u, 0x53u, 0x2200u, 0u, DMA_TEST_READ_PAD, 3u);
    store_peripheral_word(cpu, 0x7777u);
    expect(state, request(cpu, 0x53u, 0u) && request(cpu, 0x53u, 0u),
           "post-increment before mode switch");
    dspic33_write_word(cpu, 0x0b00u, 0x8010u);
    store_peripheral_word(cpu, 0x8888u);
    expect(state, request(cpu, 0x53u, 0u) && request(cpu, 0x53u, 0u),
           "fixed requests after mode switch");
    expect(state,
           dspic33_read_word(cpu, 0x2204u) == 0x8888u && dspic33_read_word(cpu, 0x2206u) == 0u,
           "fixed mode retains current internal pointer");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0010u, 0x51u, 0x2200u, 0u, DMA_TEST_READ_PAD, 2u);
    store_peripheral_word(cpu, 0x4444u);
    expect(state, request(cpu, 0x51u, 0u), "fixed first request");
    store_peripheral_word(cpu, 0x5555u);
    expect(state, request(cpu, 0x51u, 0u), "fixed second request");
    expect(state,
           dspic33_read_word(cpu, 0x2200u) == 0x5555u && dspic33_read_word(cpu, 0x2202u) == 0u,
           "fixed address");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0021u, 0x52u, 0x2400u, 0u, DMA_TEST_READ_PAD, 0u);
    store_peripheral_word(cpu, 0x6a6au);
    expect(state, request(cpu, 0x52u, 0x0034u), "peripheral indirect request");
    expect(state, dspic33_read_word(cpu, 0x2434u) == 0x6a6au, "peripheral indirect address");
    expect(state, dspic33_read_word(cpu, 0x0b04u) == 0x2434u,
           "peripheral indirect reports latest address");
}

