tylertms/dspic33e-sim/tests/device/dspic33ep_mu/memory/dma_test.c
static void operating_mode_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2500u, 0x1001u);
    dspic33_write_word(cpu, 0x2502u, 0x1002u);
    configure_channel(cpu, 0u, 0x2000u, 0x60u, 0x2500u, 0u, DMA_TEST_WRITE_PAD, 1u);
    expect(state, request(cpu, 0x60u, 0u) && request(cpu, 0x60u, 0u), "continuous first block");
    expect(state, interrupt_flag(cpu, 0u), "continuous block interrupt");
    clear_interrupt(cpu, 0u);
    expect(state, request(cpu, 0x60u, 0u), "continuous restarts address");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x1001u, "continuous primary restart");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) != 0u, "continuous remains enabled");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2500u, 0xa001u);
    dspic33_write_word(cpu, 0x2520u, 0xb001u);
    configure_channel(cpu, 0u, 0x2002u, 0x61u, 0x2500u, 0x2520u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x61u, 0u), "continuous ping first");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xa001u &&
               (dspic33_read_word(cpu, 0x0bf4u) & 1u) == 0u,
           "continuous ping primary");
    expect(state, request(cpu, 0x61u, 0u), "continuous pong request");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xb001u &&
               (dspic33_read_word(cpu, 0x0bf4u) & 1u) != 0u,
           "continuous pong secondary");
    expect(state, request(cpu, 0x61u, 0u), "continuous ping restart");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xa001u &&
               (dspic33_read_word(cpu, 0x0bf4u) & 1u) == 0u,
           "continuous ping cycles");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2500u, 0xc001u);
    dspic33_write_word(cpu, 0x2520u, 0xd001u);
    configure_channel(cpu, 0u, 0x2003u, 0x62u, 0x2500u, 0x2520u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x62u, 0u), "one-shot ping request");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) != 0u,
           "one-shot ping remains for secondary");
    expect(state, request(cpu, 0x62u, 0u), "one-shot pong request");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xd001u &&
               (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u,
           "one-shot pong disables");
}

static void interrupt_and_null_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x1000u, 0x70u, 0x2700u, 0u, DMA_TEST_READ_PAD, 3u);
    store_peripheral_word(cpu, 0x1111u);
    expect(state, request(cpu, 0x70u, 0u), "half first request");
    expect(state, !interrupt_flag(cpu, 0u), "half interrupt not early");
    expect(state, request(cpu, 0x70u, 0u), "half second request");
    expect(state, interrupt_flag(cpu, 0u), "half interrupt threshold");
    clear_interrupt(cpu, 0u);
    expect(state, request(cpu, 0x70u, 0u) && request(cpu, 0x70u, 0u), "half block completion");
    expect(state, !interrupt_flag(cpu, 0u), "half no full interrupt");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x1001u, 0x71u, 0x2700u, 0u, DMA_TEST_READ_PAD, 2u);
    store_peripheral_word(cpu, 0x2222u);
    expect(state, request(cpu, 0x71u, 0u), "odd half first request");
    expect(state, !interrupt_flag(cpu, 0u), "odd half not early");
    expect(state, request(cpu, 0x71u, 0u), "odd half second request");
    expect(state, interrupt_flag(cpu, 0u), "odd half rounds up");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DMA_TEST_BIDIRECTIONAL_PAD, 0x7b7bu);
    configure_channel(cpu, 0u, 0x0801u, 0x72u, 0x2700u, 0u, DMA_TEST_BIDIRECTIONAL_PAD, 0u);
    expect(state, request(cpu, 0x72u, 0u), "null write request");
    expect(state, dspic33_read_word(cpu, 0x2700u) == 0x7b7bu, "null write retains input");
    expect(state, dspic33_read_word(cpu, DMA_TEST_BIDIRECTIONAL_PAD) == 0u,
           "null write clears peripheral");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2800u, 0x7b7bu);
    configure_channel(cpu, 0u, 0x0001u, 0x73u, 0x2700u, 0u, 0x2800u, 0u);
    expect(state, request(cpu, 0x73u, 0u), "invalid read PAD request");
    expect(state,
           dspic33_read_word(cpu, 0x2700u) == 0u && dspic33_read_word(cpu, 0x2800u) == 0x7b7bu &&
               interrupt_flag(cpu, 0u) && (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u,
           "invalid read PAD supplies zero and completes without a handler");

    dspic33_reset(cpu, 0u);
    store_peripheral_word(cpu, 0x6a6au);
    configure_channel(cpu, 0u, 0x0801u, 0x74u, 0x2700u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, request(cpu, 0x74u, 0u), "read-only NULLW PAD request");
    expect(state,
           dspic33_read_word(cpu, 0x2700u) == 0x6a6au &&
               dspic33_read_word(cpu, DMA_TEST_READ_PAD) == 0x6a6au,
           "NULLW invokes no write handler for a read-only PAD");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0801u, 0x75u, 0x2700u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0x75u, 0u, 1u),
           "queue read-only NULLW with concurrent CPU write");
    store_peripheral_word(cpu, 0x5b5bu);
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_read_word(cpu, 0x0bf0u) == 0u &&
               cpu->trap_count == 0u,
           "read-only NULLW cannot raise a peripheral collision");
}

static void force_and_collision_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_DMA_COUNT; channel++) {
        uint16_t base = channel_base(channel);
        uint16_t bit = (uint16_t)(1u << channel);
        uint8_t source = (uint8_t)(0x80u + channel);
        uint16_t memory = (uint16_t)(0x2900u + channel * 4u);
        uint16_t pad = DMA_TEST_WRITE_PAD;
        uint16_t first = (uint16_t)(0x1100u + channel);
        uint16_t second = (uint16_t)(0x2200u + channel);

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        dspic33_write_word(cpu, (uint16_t)(memory + 2u), second);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 3u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE software set matrix");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), source);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE write zero cannot clear matrix");
        expect(state, dspic33_device_advance(cpu, 1u), "FORCE start matrix");
        expect(state,
               stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 0u &&
                   !interrupt_flag(cpu, channel) && (dspic33_read_word(cpu, base) & 0x8000u) != 0u,
               "FORCE remains active before completion matrix");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE remains set until completion matrix");
        expect(state, dspic33_device_advance(cpu, 1u), "FORCE completion matrix");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "FORCE hardware clear matrix");
        expect(state, cpu->io.dma_index[channel] == 1u, "FORCE completion advances count matrix");
        expect(state, dspic33_device_advance(cpu, 2u), "FORCE idle advance matrix");
        expect(state, stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 1u,
               "FORCE exactly one transfer matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 1u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (cpu->io.dma_forced_pending & bit) != 0u,
               "FORCE pending before disable matrix");
        dspic33_write_word(cpu, base, 0x2000u);
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u &&
                   (cpu->io.dma_forced_pending & bit) == 0u,
               "disable clears FORCE pending matrix");
        expect(state, dspic33_device_advance(cpu, 2u) && stored_word(cpu, pad) == 0u,
               "disabled FORCE does not transfer matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 1u);
        expect(state, dspic33_dma_request(cpu, source, 0u, 1u),
               "queue peripheral before FORCE matrix");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (dspic33_read_word(cpu, 0x0bf2u) & bit) != 0u,
               "peripheral before FORCE collision matrix");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "peripheral before FORCE discard matrix");
        expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
               "peripheral before FORCE trap matrix");
        dspic33_write_word(cpu, 0x08c0u, (uint16_t)(dspic33_read_word(cpu, 0x08c0u) & ~0x0020u));
        expect(state, dspic33_read_word(cpu, 0x0bf2u) == 0u,
               "peripheral before FORCE collision clear matrix");
        expect(state, dspic33_device_advance(cpu, 2u), "peripheral before FORCE advance matrix");
        expect(state, stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 1u,
               "peripheral before FORCE one transfer matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        dspic33_write_word(cpu, (uint16_t)(memory + 2u), second);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 3u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, dspic33_dma_request(cpu, source, 0u, 1u),
               "queue peripheral after FORCE matrix");
        expect(state, (dspic33_read_word(cpu, 0x0bf2u) & bit) != 0u,
               "FORCE before peripheral collision matrix");
        expect(state, dspic33_device_advance(cpu, 1u), "FORCE before peripheral start matrix");
        expect(state,
               stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE executes before peripheral matrix");
        expect(state, dspic33_device_advance(cpu, 1u), "FORCE before peripheral deferred matrix");
        expect(state,
               stored_word(cpu, pad) == second && cpu->io.dma_index[channel] == 1u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "peripheral executes after FORCE matrix");
        expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
               "FORCE before peripheral trap matrix");
        expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.dma_index[channel] == 2u,
               "peripheral collision completion matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        dspic33_write_word(cpu, (uint16_t)(memory + 2u), second);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 3u);
        expect(state, dspic33_dma_request(cpu, source, 0u, 0u) && dspic33_device_advance(cpu, 0u),
               "start active peripheral transfer matrix");
        expect(state, (cpu->io.dma_active & bit) != 0u, "peripheral transfer active matrix");
        expect(state, stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 0u,
               "active peripheral first transfer matrix");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "FORCE ignored while active matrix");
        expect(state, (dspic33_read_word(cpu, 0x0bf2u) & bit) != 0u,
               "active FORCE request collision matrix");
        expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
               "active FORCE collision trap matrix");
        expect(state, dspic33_device_advance(cpu, 1u), "active transfer completion matrix");
        expect(state, (cpu->io.dma_active & bit) == 0u, "active transfer clears matrix");
        expect(state, cpu->io.dma_index[channel] == 1u, "active transfer count completes matrix");
        expect(state,
               dspic33_device_advance(cpu, 1u) && stored_word(cpu, pad) == first &&
                   cpu->io.dma_index[channel] == 1u,
               "ignored active FORCE does not transfer matrix");
    }
}

static void routing_and_status_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2b00u, 0x1000u);
    dspic33_write_word(cpu, 0x2b20u, 0x2000u);
    configure_channel(cpu, 2u, 0x2000u, 0x90u, 0x2b20u, 0u, DMA_TEST_ALT_WRITE_PAD, 0u);
    configure_channel(cpu, 0u, 0x2000u, 0x90u, 0x2b00u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x90u, 0u), "shared request routing");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x1000u &&
               dspic33_read_word(cpu, DMA_TEST_ALT_WRITE_PAD) == 0x2000u,
           "shared request reaches channels");
    expect(state, dspic33_read_word(cpu, 0x0bf6u) == 2u, "lower channel priority executes first");
    expect(state, interrupt_flag(cpu, 0u) && !interrupt_flag(cpu, 2u) && cpu->io.dma_active == 4u,
           "lower-priority channel remains active after arbitration");
    expect(state,
           dspic33_device_advance(cpu, 1u) && interrupt_flag(cpu, 2u) && cpu->io.dma_active == 0u,
           "channel interrupt mapping");

    dspic33_reset(cpu, 0u);
    cpu->data[0] = 0x9eu;
    cpu->data[1] = 0x9eu;
    dspic33_write_word(cpu, DMA_TEST_WRITE_PAD, 0xffffu);
    configure_channel(cpu, 0u, 0x2001u, 0x92u, DSPIC33_DATA_SIZE, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x92u, 0u), "out-of-range request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xffffu,
           "out-of-range DMA leaves peripheral unchanged");
    expect(state, cpu->last_trap == 6u && cpu->trap_count == 1u, "out-of-range DMA address trap");
    expect(state, (dspic33_read_word(cpu, 0x08c4u) & 0x0020u) != 0u, "out-of-range DMA sets DAE");
}

static void channel_matrix_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_DMA_COUNT; channel++) {
        uint8_t source = (uint8_t)(0xb0u + channel);
        uint16_t memory = (uint16_t)(0x3000u + channel * 4u);
        uint16_t pad = DMA_TEST_WRITE_PAD;
        uint16_t value = (uint16_t)(0x4000u + channel);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, value);
        configure_channel(cpu, channel, 0x2001u, source, memory, 0u, pad, 0u);
        expect(state, request(cpu, source, 0u), "channel request matrix");
        expect(state, stored_word(cpu, pad) == value, "channel transfer matrix");
        expect(state, interrupt_flag(cpu, channel), "channel interrupt matrix");
        expect(state, dspic33_read_word(cpu, 0x0bf6u) == channel, "channel status matrix");
        expect(state, (dspic33_read_word(cpu, channel_base(channel)) & 0x8000u) == 0u,
               "channel one-shot matrix");
    }
}

static void peripheral_collision_cases(TestState* state, Dspic33* cpu) {
    uint8_t can_channel;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3200u, 0x1111u);
    dspic33_write_word(cpu, 0x3202u, 0x2222u);
    configure_channel(cpu, 0u, 0x2000u, 0xc0u, 0x3200u, 0u, DMA_TEST_WRITE_PAD, 1u);
    expect(state, dspic33_dma_request(cpu, 0xc0u, 0u, 1u), "queue peripheral write collision");
    dspic33_write_word(cpu, DMA_TEST_WRITE_PAD, 0x7777u);
    expect(state, dspic33_device_advance(cpu, 1u), "advance peripheral write collision");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x7777u, "CPU peripheral write prevails");
    expect(state, (dspic33_read_word(cpu, 0x0bf0u) & 1u) != 0u, "peripheral collision status");
    expect(state, cpu->last_trap == 5u && cpu->trap_count == 1u, "peripheral collision trap");
    expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
           "peripheral collision DMACERR");
    expect(state, dspic33_dma_request(cpu, 0xc0u, 0u, 0u) && dspic33_device_advance(cpu, 0u),
           "request blocked by collision");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x7777u,
           "collision blocks subsequent transfer");
    dspic33_write_word(cpu, 0x08c0u, (uint16_t)(dspic33_read_word(cpu, 0x08c0u) & ~0x0020u));
    expect(state, dspic33_read_word(cpu, 0x0bf0u) == 0u, "clearing DMACERR clears write collision");
    expect(state, request(cpu, 0xc0u, 0u), "request resumes after collision clear");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x2222u,
           "transfer resumes after collision clear");

