tylertms/dspic33e-sim/tests/device/dspic33ep_mu/memory/dma_test.c
    for (can_channel = 0u; can_channel < 2u; can_channel++) {
        uint16_t pad = (uint16_t)(0x0442u + can_channel * 0x0100u);
        uint8_t request_source = (uint8_t)(0xc3u + can_channel);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x3200u, 0x1111u);
        dspic33_write_word(cpu, 0x3202u, 0x2222u);
        configure_channel(cpu, 0u, 0x2000u, request_source, 0x3200u, 0u, pad, 1u);
        expect(state, dspic33_dma_request(cpu, request_source, 0u, 1u),
               "queue B1 ECAN write collision");
        dspic33_write_word(cpu, pad, 0x7777u);
        expect(state, dspic33_device_advance(cpu, 1u), "advance B1 ECAN write collision");
        expect(state,
               stored_word(cpu, pad) == 0x7777u && dspic33_read_word(cpu, 0x0bf0u) == 0u &&
                   cpu->trap_count == 0u && (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) == 0u,
               "B1 ECAN write collision leaves collision state clear");
        expect(state, dspic33_device_advance(cpu, 1u) && request(cpu, request_source, 0u),
               "B1 ECAN DMA channel accepts a later request");
        expect(state, stored_word(cpu, pad) == 0x2222u, "B1 ECAN DMA transfers after a collision");
    }
}

static void memory_collision_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3400u, 0x1111u);
    configure_channel(cpu, 0u, 0x2001u, 0xc1u, 0x3400u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0xc1u, 0u, 1u), "queue concurrent DMA memory read");
    dspic33_write_word(cpu, 0x3400u, 0x2222u);
    expect(state, dspic33_device_advance(cpu, 1u), "advance concurrent DMA memory read");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x1111u,
           "DMA reads pre-write memory value");
    expect(state, dspic33_read_word(cpu, 0x3400u) == 0x2222u, "CPU memory write remains visible");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3400u, 0xaaaau);
    store_peripheral_word(cpu, 0x3333u);
    configure_channel(cpu, 0u, 0x0001u, 0xc2u, 0x3400u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0xc2u, 0u, 1u), "queue concurrent DMA memory write");
    dspic33_write_word(cpu, 0x3400u, 0xbbbbu);
    expect(state, dspic33_device_advance(cpu, 1u), "advance concurrent DMA memory write");
    expect(state, dspic33_read_word(cpu, 0x3400u) == 0xbbbbu,
           "CPU write wins concurrent DMA memory write");
    expect(state, dspic33_read_word(cpu, 0x0bf0u) == 0u,
           "memory collision does not set peripheral status");
}

static void stale_request_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2d00u, 0x1111u);
    configure_channel(cpu, 0u, 0x2000u, 0xa0u, 0x2d00u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0xa0u, 0u, 5u), "queue stale request");
    dspic33_write_word(cpu, 0x0b00u, 0x2000u);
    dspic33_write_word(cpu, 0x2d00u, 0x2222u);
    dspic33_write_word(cpu, 0x0b00u, 0xa000u);
    expect(state, dspic33_device_advance(cpu, 5u), "advance stale request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0u,
           "stale request discarded after re-enable");
    expect(state, request(cpu, 0xa0u, 0u), "new generation request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x2222u, "new generation transfers");
}

static void can_receive_arbiter_erratum_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t requests[] = {34u, 55u};
    size_t index;
    for (index = 0u; index < sizeof(requests) / sizeof(requests[0]); index++) {
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x3600u, 0x1357u);
        configure_channel(cpu, 0u, 0x2001u, requests[index], 0u, 0u, DMA_TEST_WRITE_PAD, 0u);
        expect(state,
               dspic33_dma_request(cpu, requests[index], 0u, 5u) &&
                   cpu->io.dma_peripheral_pending == 1u,
               "delayed CAN receive DMA transaction remains queued");
        expect(state,
               dspic33_dma_request(cpu, requests[index], 0u, 0u) &&
                   cpu->stop_reason == DSPIC33_RUNNING,
               "queued delay alone does not imply a DMA arbiter hold");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x3600u, 0x1357u);
        configure_channel(cpu, 0u, 0x2001u, requests[index], 0u, 0u, DMA_TEST_WRITE_PAD, 0u);
        dspic33_load_program_word(cpu, 0x0200u, OPCODE_MOV_W1_POST_INCREMENT_W2);
        cpu->pc = 0x0200u;
        dspic33_set_working_register(cpu, 1u, 0x3800u);
        dspic33_write_word(cpu, 0x3800u, 0x55aau);
        {
            bool queued = dspic33_dma_request(cpu, requests[index], 0x3600u, 1u);
            Dspic33StopReason stepped = dspic33_step(cpu);
            expect(state,
                   queued && stepped == DSPIC33_RUNNING && cpu->w[2] == 0x55aau &&
                       (cpu->io.dma_arbiter_waiting & 1u) != 0u,
                   "CAN receive DMA transaction waits for the CPU bus master");
        }
        expect(state,
               dspic33_dma_request(cpu, requests[index], 0xd000u, 0u) &&
                   cpu->stop_reason == DSPIC33_SILICON_RESULT_UNDEFINED,
               "B1 CAN receive request remains undefined after ordinary RAM wait");

        cpu->stop_reason = DSPIC33_RUNNING;
        dspic33_write_word(cpu, 0x0b00u, 0x2001u);
        dspic33_write_word(cpu, 0x0b00u, 0xa001u);
        expect(state,
               (cpu->io.dma_arbiter_waiting & 1u) == 0u &&
                   dspic33_dma_request(cpu, requests[index], 0u, 0u) &&
                   cpu->stop_reason == DSPIC33_RUNNING,
               "DMA disable and re-enable clears stale arbiter-wait history");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0058u, 0x0020u);
        dspic33_write_word(cpu, 0x3600u, 0x1357u);
        configure_channel(cpu, 0u, 0x2001u, requests[index], 0x3600u, 0u, DMA_TEST_WRITE_PAD, 0u);
        dspic33_load_program_word(cpu, 0x0200u, OPCODE_MOV_W1_POST_INCREMENT_W2);
        cpu->pc = 0x0200u;
        dspic33_set_working_register(cpu, 1u, 0x3800u);
        dspic33_write_word(cpu, 0x3800u, 0x55aau);
        expect(state,
               dspic33_dma_request(cpu, requests[index], 0u, 1u) &&
                   dspic33_step(cpu) == DSPIC33_RUNNING &&
                   dspic33_dma_request(cpu, requests[index], 0u, 0u) &&
                   cpu->stop_reason == DSPIC33_RUNNING,
               "MSTRPR workaround excludes the B1 request-loss boundary");

        dspic33_reset(cpu, 0u);
        configure_channel(cpu, 0u, 0x0001u, requests[index], 0xd000u, 0u, DMA_TEST_WRITE_PAD, 0u);
        dspic33_load_program_word(cpu, 0x0200u, OPCODE_MOV_W1_POST_INCREMENT_W2);
        cpu->pc = 0x0200u;
        dspic33_set_working_register(cpu, 1u, 0x3800u);
        dspic33_write_word(cpu, 0x3800u, 0x55aau);
        expect(state,
               dspic33_dma_request(cpu, requests[index], 0u, 1u) &&
                   dspic33_step(cpu) == DSPIC33_RUNNING &&
                   dspic33_dma_request(cpu, requests[index], 0u, 0u) &&
                   cpu->stop_reason == DSPIC33_RUNNING,
               "dual-port RAM workaround excludes the B1 request-loss boundary");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x3600u, 0x1357u);
        configure_channel(cpu, 0u, 0x2001u, requests[index], 0x3600u, 0u, DMA_TEST_WRITE_PAD, 0u);
        expect(state,
               dspic33_dma_request(cpu, requests[index], 0u, 0u) &&
                   (dspic33_write_word(cpu, 0x3800u, 0x55aau), true) &&
                   dspic33_device_advance(cpu, 0u) && cpu->io.dma_arbiter_waiting == 0u,
               "external setup writes do not synthesize CPU bus contention");
    }
}

