tylertms/dspic33e-sim/tests/device/dspic33ep_mu/memory/dma_test.c
    generation = cpu->io.dma_generation[0];
    expect(state, generation != 0u, "DMA lifecycle advances generation");
}

int main(void) {
    TestState state = {0u, 0u, 0u};
    Dspic33 cpu;
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize DMA processor");
    if (initialized) {
        pad_membership_cases(&state);
        register_cases(&state, &cpu);
        direction_and_width_cases(&state, &cpu);
        invalid_write_cases(&state, &cpu);
        addressing_cases(&state, &cpu);
        operating_mode_cases(&state, &cpu);
        interrupt_and_null_cases(&state, &cpu);
        force_and_collision_cases(&state, &cpu);
        routing_and_status_cases(&state, &cpu);
        channel_matrix_cases(&state, &cpu);
        peripheral_collision_cases(&state, &cpu);
        memory_collision_cases(&state, &cpu);
        stale_request_cases(&state, &cpu);
        dspic33_dma_test_boundary_cases(&state, &cpu);
        can_receive_arbiter_erratum_cases(&state, &cpu);
        {
            Dspic33 copy;
            bool copy_initialized = dspic33_initialize(&copy);
            expect(&state, copy_initialized, "initialize DMA copy processor");
            if (copy_initialized) {
                power_and_lifecycle_cases(&state, &cpu, &copy);
                dspic33_release(&copy);
            }
        }
        device_memory_address_cases(&state);
        device_dual_port_ram_cases(&state);
        dspic33_release(&cpu);
    }
    return test_finish(&state);
}
